"""
语法格式为：序列[起始索引:结束索引:步长]
相关注意点如下：
1. 切片操作的区间是左闭右开的，即：截取时包含起始位置，但不包含结束位置。
2. 步长是指取出元素时的间隔，例如：
o 步长为 1，就是一个一个取出。
o 步长为 2，就是每次越过 1 个元素取出。
o 步长为 3，就是每次越过 2 个元素取出。
o 步长为 n，就是每次越过 n-1 个元素取出。
3. 起始索引默认值为 0，结束索引默认截取到末尾，步长默认值为 1。
4. 当起始索引大于结束索引时，步长必须为负数，否则结果是空列表。
"""
# 对列表进行切片
# list1 = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
# list2 = list1[0:5:1]
# print(list2)

# list1 = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
# list2 = list1[1:8:2]
# print(list2)

# list1 = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
# list2 = list1[1:8:3]
# print(list2)

# list1 = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
# list2 = list1[::]
# print(list2)

# list1 = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
# list2 = list1[:999:]
# print(list2)

# list1 = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
# list2 = list1[3::]
# print(list2)

# list1 = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
# list2 = list1[:5:]
# print(list2)

# list1 = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
# list2 = list1[::4]
# print(list2)

# list1 = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
# list2 = list1[7:2:-1]
# print(list2)

# 一个特殊情况：当同时省略起始索引和结束索引时，如果步长为负数，那Python会自动对调：起始位置和结束位置
# list1 = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
# list2 = list1[::-1]
# print(list2)

# 对元组进行切片
# tuple1 = (10, 20, 30, 40, 50, 60, 70, 80, 90, 100)
# tuple2 = tuple1[0:5:1]
# print(tuple2)

# 对字符串进行切片
msg1 = 'welcome to atguigu'
msg2 = msg1[2:9:2]
print(msg2)

